perf-tests/results_new_20260420_151648/webflux/ab_accounts_50k.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Completed 30000 requests
Completed 35000 requests
Completed 40000 requests
Completed 45000 requests
Completed 50000 requests
Finished 50000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8082

Document Path:          /accounts
Document Length:        1055 bytes

Concurrency Level:      100
Time taken for tests:   5.185 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      56400000 bytes
HTML transferred:       52750000 bytes
Requests per second:    9643.61 [#/sec] (mean)
Time per request:       10.370 [ms] (mean)
Time per request:       0.104 [ms] (mean, across all concurrent requests)
Transfer rate:          10623.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.2      0      64
Processing:     0    9   7.5      7     597
Waiting:        0    8   7.4      7     594
Total:          0    9   7.7      8     597

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%     11
  80%     12
  90%     15
  95%     20
  98%     29
  99%     39
 100%    597 (longest request)