perf-tests/results_new_20260420_151648/webflux/k6_stress_accounts.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /Users/naghayev/Desktop/investigate_bff/perf-tests/k6_stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m50s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 1m20s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 010/200 VUs, 45 complete and 0 interrupted iterations
default   [   1% ] 010/200 VUs  0m01.0s/1m20.0s

running (0m02.0s), 020/200 VUs, 190 complete and 0 interrupted iterations
default   [   2% ] 020/200 VUs  0m02.0s/1m20.0s

running (0m03.0s), 030/200 VUs, 429 complete and 0 interrupted iterations
default   [   4% ] 030/200 VUs  0m03.0s/1m20.0s

running (0m04.0s), 040/200 VUs, 754 complete and 0 interrupted iterations
default   [   5% ] 040/200 VUs  0m04.0s/1m20.0s

running (0m05.0s), 050/200 VUs, 1195 complete and 0 interrupted iterations
default   [   6% ] 050/200 VUs  0m05.0s/1m20.0s

running (0m06.0s), 060/200 VUs, 1348 complete and 0 interrupted iterations
default   [   7% ] 060/200 VUs  0m06.0s/1m20.0s

running (0m07.0s), 070/200 VUs, 1872 complete and 0 interrupted iterations
default   [   9% ] 070/200 VUs  0m07.0s/1m20.0s

running (0m08.0s), 080/200 VUs, 2542 complete and 0 interrupted iterations
default   [  10% ] 080/200 VUs  0m08.0s/1m20.0s

running (0m09.0s), 089/200 VUs, 3373 complete and 0 interrupted iterations
default   [  11% ] 089/200 VUs  0m09.0s/1m20.0s

running (0m10.0s), 099/200 VUs, 4266 complete and 0 interrupted iterations
default   [  12% ] 099/200 VUs  0m10.0s/1m20.0s

running (0m11.0s), 100/200 VUs, 5232 complete and 0 interrupted iterations
default   [  14% ] 100/200 VUs  0m11.0s/1m20.0s

running (0m12.0s), 100/200 VUs, 6132 complete and 0 interrupted iterations
default   [  15% ] 100/200 VUs  0m12.0s/1m20.0s

running (0m13.0s), 100/200 VUs, 6332 complete and 0 interrupted iterations
default   [  16% ] 100/200 VUs  0m13.0s/1m20.0s

running (0m14.0s), 100/200 VUs, 7332 complete and 0 interrupted iterations
default   [  17% ] 100/200 VUs  0m14.0s/1m20.0s

running (0m15.0s), 100/200 VUs, 8243 complete and 0 interrupted iterations
default   [  19% ] 100/200 VUs  0m15.0s/1m20.0s

running (0m16.0s), 100/200 VUs, 9232 complete and 0 interrupted iterations
default   [  20% ] 100/200 VUs  0m16.0s/1m20.0s

running (0m17.0s), 100/200 VUs, 10136 complete and 0 interrupted iterations
default   [  21% ] 100/200 VUs  0m17.0s/1m20.0s

running (0m18.0s), 100/200 VUs, 11132 complete and 0 interrupted iterations
default   [  22% ] 100/200 VUs  0m18.0s/1m20.0s

running (0m19.0s), 100/200 VUs, 11532 complete and 0 interrupted iterations
default   [  24% ] 100/200 VUs  0m19.0s/1m20.0s

running (0m20.0s), 100/200 VUs, 12332 complete and 0 interrupted iterations
default   [  25% ] 100/200 VUs  0m20.0s/1m20.0s

running (0m21.0s), 100/200 VUs, 13232 complete and 0 interrupted iterations
default   [  26% ] 100/200 VUs  0m21.0s/1m20.0s

running (0m22.0s), 100/200 VUs, 14232 complete and 0 interrupted iterations
default   [  27% ] 100/200 VUs  0m22.0s/1m20.0s

running (0m23.0s), 100/200 VUs, 15132 complete and 0 interrupted iterations
default   [  29% ] 100/200 VUs  0m23.0s/1m20.0s

running (0m24.0s), 100/200 VUs, 16132 complete and 0 interrupted iterations
default   [  30% ] 100/200 VUs  0m24.0s/1m20.0s

running (0m25.0s), 100/200 VUs, 16910 complete and 0 interrupted iterations
default   [  31% ] 100/200 VUs  0m25.0s/1m20.0s

running (0m26.0s), 100/200 VUs, 17310 complete and 0 interrupted iterations
default   [  32% ] 100/200 VUs  0m26.0s/1m20.0s

running (0m27.0s), 100/200 VUs, 18238 complete and 0 interrupted iterations
default   [  34% ] 100/200 VUs  0m27.0s/1m20.0s

running (0m28.0s), 100/200 VUs, 19210 complete and 0 interrupted iterations
default   [  35% ] 100/200 VUs  0m28.0s/1m20.0s

running (0m29.0s), 100/200 VUs, 20210 complete and 0 interrupted iterations
default   [  36% ] 100/200 VUs  0m29.0s/1m20.0s

running (0m30.0s), 100/200 VUs, 21110 complete and 0 interrupted iterations
default   [  37% ] 100/200 VUs  0m30.0s/1m20.0s

running (0m31.0s), 100/200 VUs, 22110 complete and 0 interrupted iterations
default   [  39% ] 100/200 VUs  0m31.0s/1m20.0s

running (0m32.0s), 100/200 VUs, 22323 complete and 0 interrupted iterations
default   [  40% ] 100/200 VUs  0m32.0s/1m20.0s

running (0m33.0s), 100/200 VUs, 23310 complete and 0 interrupted iterations
default   [  41% ] 100/200 VUs  0m33.0s/1m20.0s

running (0m34.0s), 100/200 VUs, 24310 complete and 0 interrupted iterations
default   [  42% ] 100/200 VUs  0m34.0s/1m20.0s

running (0m35.0s), 100/200 VUs, 25210 complete and 0 interrupted iterations
default   [  44% ] 100/200 VUs  0m35.0s/1m20.0s

running (0m36.0s), 100/200 VUs, 26210 complete and 0 interrupted iterations
default   [  45% ] 100/200 VUs  0m36.0s/1m20.0s

running (0m37.0s), 100/200 VUs, 27110 complete and 0 interrupted iterations
default   [  46% ] 100/200 VUs  0m37.0s/1m20.0s

running (0m38.0s), 100/200 VUs, 27710 complete and 0 interrupted iterations
default   [  47% ] 100/200 VUs  0m38.0s/1m20.0s

running (0m39.0s), 100/200 VUs, 28310 complete and 0 interrupted iterations
default   [  49% ] 100/200 VUs  0m39.0s/1m20.0s

running (0m40.0s), 100/200 VUs, 29310 complete and 0 interrupted iterations
default   [  50% ] 100/200 VUs  0m40.0s/1m20.0s

running (0m41.0s), 109/200 VUs, 30254 complete and 0 interrupted iterations
default   [  51% ] 109/200 VUs  0m41.0s/1m20.0s

running (0m42.0s), 119/200 VUs, 31381 complete and 0 interrupted iterations
default   [  52% ] 119/200 VUs  0m42.0s/1m20.0s

running (0m43.0s), 129/200 VUs, 32616 complete and 0 interrupted iterations
default   [  54% ] 129/200 VUs  0m43.0s/1m20.0s

running (0m44.0s), 139/200 VUs, 33838 complete and 0 interrupted iterations
default   [  55% ] 139/200 VUs  0m44.0s/1m20.0s

running (0m45.0s), 149/200 VUs, 34279 complete and 0 interrupted iterations
default   [  56% ] 149/200 VUs  0m45.0s/1m20.0s

running (0m46.0s), 159/200 VUs, 35668 complete and 0 interrupted iterations
default   [  57% ] 159/200 VUs  0m46.0s/1m20.0s

running (0m47.0s), 169/200 VUs, 37303 complete and 0 interrupted iterations
default   [  59% ] 169/200 VUs  0m47.0s/1m20.0s

running (0m48.0s), 179/200 VUs, 39038 complete and 0 interrupted iterations
default   [  60% ] 179/200 VUs  0m48.0s/1m20.0s

running (0m49.0s), 189/200 VUs, 40855 complete and 0 interrupted iterations
default   [  61% ] 189/200 VUs  0m49.0s/1m20.0s

running (0m50.0s), 199/200 VUs, 42649 complete and 0 interrupted iterations
default   [  62% ] 199/200 VUs  0m50.0s/1m20.0s

running (0m51.0s), 200/200 VUs, 43304 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  0m51.0s/1m20.0s

running (0m52.0s), 200/200 VUs, 45104 complete and 0 interrupted iterations
default   [  65% ] 200/200 VUs  0m52.0s/1m20.0s

running (0m53.0s), 200/200 VUs, 47016 complete and 0 interrupted iterations
default   [  66% ] 200/200 VUs  0m53.0s/1m20.0s

running (0m54.0s), 200/200 VUs, 48904 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  0m54.0s/1m20.0s

running (0m55.0s), 200/200 VUs, 50904 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  0m55.0s/1m20.0s

running (0m56.0s), 200/200 VUs, 52704 complete and 0 interrupted iterations
default   [  70% ] 200/200 VUs  0m56.0s/1m20.0s

running (0m57.0s), 200/200 VUs, 54263 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  0m57.0s/1m20.0s

running (0m58.0s), 200/200 VUs, 55063 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  0m58.0s/1m20.0s

running (0m59.0s), 200/200 VUs, 57063 complete and 0 interrupted iterations
default   [  74% ] 200/200 VUs  0m59.0s/1m20.0s

running (1m00.0s), 200/200 VUs, 58937 complete and 0 interrupted iterations
default   [  75% ] 200/200 VUs  1m00.0s/1m20.0s

running (1m01.0s), 200/200 VUs, 60863 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  1m01.0s/1m20.0s

running (1m02.0s), 200/200 VUs, 62863 complete and 0 interrupted iterations
default   [  77% ] 200/200 VUs  1m02.0s/1m20.0s

running (1m03.0s), 200/200 VUs, 64863 complete and 0 interrupted iterations
default   [  79% ] 200/200 VUs  1m03.0s/1m20.0s

running (1m04.0s), 200/200 VUs, 65263 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  1m04.0s/1m20.0s

running (1m05.0s), 200/200 VUs, 66863 complete and 0 interrupted iterations
default   [  81% ] 200/200 VUs  1m05.0s/1m20.0s

running (1m06.0s), 200/200 VUs, 68863 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  1m06.0s/1m20.0s

running (1m07.0s), 200/200 VUs, 70863 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  1m07.0s/1m20.0s

running (1m08.0s), 200/200 VUs, 72663 complete and 0 interrupted iterations
default   [  85% ] 200/200 VUs  1m08.0s/1m20.0s

running (1m09.0s), 200/200 VUs, 74663 complete and 0 interrupted iterations
default   [  86% ] 200/200 VUs  1m09.0s/1m20.0s

running (1m10.0s), 200/200 VUs, 76263 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  1m10.0s/1m20.0s

running (1m11.0s), 182/200 VUs, 76833 complete and 0 interrupted iterations
default   [  89% ] 182/200 VUs  1m11.0s/1m20.0s

running (1m12.0s), 161/200 VUs, 78563 complete and 0 interrupted iterations
default   [  90% ] 161/200 VUs  1m12.0s/1m20.0s

running (1m13.0s), 142/200 VUs, 79947 complete and 0 interrupted iterations
default   [  91% ] 142/200 VUs  1m13.0s/1m20.0s

running (1m14.0s), 122/200 VUs, 81273 complete and 0 interrupted iterations
default   [  92% ] 122/200 VUs  1m14.0s/1m20.0s

running (1m15.0s), 101/200 VUs, 82400 complete and 0 interrupted iterations
default   [  94% ] 101/200 VUs  1m15.0s/1m20.0s

running (1m16.0s), 082/200 VUs, 83235 complete and 0 interrupted iterations
default   [  95% ] 082/200 VUs  1m16.0s/1m20.0s

running (1m17.0s), 074/200 VUs, 83551 complete and 0 interrupted iterations
default   [  96% ] 074/200 VUs  1m17.0s/1m20.0s

running (1m18.0s), 043/200 VUs, 83925 complete and 0 interrupted iterations
default   [  97% ] 043/200 VUs  1m18.0s/1m20.0s

running (1m19.0s), 021/200 VUs, 84256 complete and 0 interrupted iterations
default   [  99% ] 021/200 VUs  1m19.0s/1m20.0s

running (1m20.0s), 003/200 VUs, 84373 complete and 0 interrupted iterations
default   [ 100% ] 003/200 VUs  1m20.0s/1m20.0s

     ✓ status 200

     checks.........................: 100.00% 84377 out of 84377
     data_received..................: 95 MB   1.2 MB/s
     data_sent......................: 7.4 MB  93 kB/s
     http_req_blocked...............: avg=4.5µs    min=0s       med=2µs     max=4.79ms   p(90)=5µs      p(95)=7µs     
     http_req_connecting............: avg=889ns    min=0s       med=0s      max=4.3ms    p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=18.16ms  min=244µs    med=2.22ms  max=929.99ms p(90)=7.17ms   p(95)=9.88ms  
       { expected_response:true }...: avg=18.16ms  min=244µs    med=2.22ms  max=929.99ms p(90)=7.17ms   p(95)=9.88ms  
     http_req_failed................: 0.00%   0 out of 84377
     http_req_receiving.............: avg=21.57µs  min=4µs      med=12µs    max=4.46ms   p(90)=36µs     p(95)=53µs    
     http_req_sending...............: avg=16.35µs  min=1µs      med=5µs     max=11.44ms  p(90)=22µs     p(95)=52µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=18.13ms  min=236µs    med=2.18ms  max=929.98ms p(90)=7.1ms    p(95)=9.79ms  
     http_reqs......................: 84377   1053.44172/s
     iteration_duration.............: avg=118.75ms min=100.27ms med=102.9ms max=1.03s    p(90)=108.07ms p(95)=111.06ms
     iterations.....................: 84377   1053.44172/s
     vus............................: 3       min=3              max=200
     vus_max........................: 200     min=200            max=200


running (1m20.1s), 000/200 VUs, 84377 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  1m20s